In [2]:
# Required libraries
from sqlalchemy import create_engine
import pandas as pd
from haversine import haversine, Unit

def query_to_dataframe(connection_string, query):
    """
    Query a MySQL database using SQLAlchemy and return the result as a pandas DataFrame.

    Parameters:
    - connection_string (str): The connection string for the database.
    - query (str): The SQL query to be executed.

    Returns:
    - df (pd.DataFrame): The result of the query as a pandas DataFrame.
    """
    # Create an engine
    engine = create_engine(connection_string)
    
    # Connect to the engine and execute the query
    with engine.connect() as connection:
        df = pd.read_sql(query, connection)
        
    return df

In [3]:
# Example Usage:

# Define the connection string
# Format: "mysql+<driver_name>://<username>:<password>@<host>:<port>/<database_name>"
connection_string = "mysql+mysqlconnector://arasham:Generalfuzn03?@tdt4225-10.idi.ntnu.no:3306/default_db"

In [3]:
sql_query1 = "select * from user"
sql_query2 = "select * from activity"
sql_query3 = "select * from track_point"

In [4]:
df1 = query_to_dataframe(connection_string, sql_query1)
df1

      id  has_labels
0    000           0
1    001           0
2    002           0
3    003           0
4    004           0
..   ...         ...
168  176           0
169  178           0
170  179           1
171  180           0
172  181           0

[173 rows x 2 columns]

In [5]:
df2 = query_to_dataframe(connection_string, sql_query2)
df2

,id,user_id,transportation_mode,start_date_time,end_date_time
0,20000101231219163,163,None,2000-01-01 23:12:19,2000-01-01 23:15:23
1,20070412093132142,142,None,2007-04-12 09:31:32,2007-04-12 11:33:40
2,20070412101853161,161,None,2007-04-12 10:18:53,2007-04-12 10:23:15
3,20070412102116163,163,bike,2007-04-12 10:21:16,2007-04-12 14:56:56
4,20070412102325161,161,None,2007-04-12 10:23:25,2007-04-12 10:26:25
...,...,...,...,...,...
16043,20120724204557163,163,None,2012-07-24 20:45:57,2012-07-24 22:01:15
16044,20120725080203163,163,None,2012-07-25 08:02:03,2012-07-25 08:26:13
16045,20120725190300163,163,None,2012-07-25 19:03:00,2012-07-25 19:55:08
16046,20120726080106163,163,None,2012-07-26 08:01:06,2012-07-26 08:27:24
16047,20120727080700163,163,None,2012-07-27 08:07:00,2012-07-27 08:31:20

In [6]:
df2["transportation_mode"].unique()

array([None, 'bike', 'taxi', 'walk', 'car', 'bus', 'subway', 'run',
       'train', 'airplane', 'boat'], dtype=object)

In [7]:
df3 = query_to_dataframe(connection_string, sql_query3)
df3

,id,activity_id,lat,lon,altitude,date_days,date_time
0,1,20090412073303000,40.000017,116.327479,105,39915.314618,2009-04-12 07:33:03
1,2,20090412073303000,40.000168,116.327474,80,39915.314688,2009-04-12 07:33:09
2,3,20090412073303000,40.000055,116.327454,99,39915.314745,2009-04-12 07:33:14
3,4,20090412073303000,40.000021,116.327407,109,39915.314803,2009-04-12 07:33:19
4,5,20090412073303000,40.000035,116.327281,111,39915.314861,2009-04-12 07:33:24
...,...,...,...,...,...,...,...
9681751,9681752,20071208010931181,39.866483,116.415383,249,39424.298426,2007-12-08 07:09:44
9681752,9681753,20071208010931181,39.866033,116.415683,174,39424.299537,2007-12-08 07:11:20
9681753,9681754,20071208010931181,39.865550,116.415733,187,39424.300486,2007-12-08 07:12:42
9681754,9681755,20071208010931181,39.864883,116.415750,226,39424.301412,2007-12-08 07:14:02
9681755,9681756,20071208010931181,39.864567,116.416250,118,39424.302546,2007-12-08 07:15:40

In [8]:
#Task 1: 

sql_query1 = """
    SELECT COUNT(*) AS num_users
    FROM user;
"""

sql_query2 = """
    SELECT COUNT(*) AS num_activities 
    FROM activity;
"""

sql_query3 = """ 
    SELECT COUNT(*) AS num_trackpoints
    FROM track_point;
"""

df = query_to_dataframe(connection_string, sql_query3)
df

   num_trackpoints
0          9681756

In [9]:
# Task 2
sql_query = """
    WITH user_tp_count AS (
        SELECT user_id, count(*) AS tp_count
        FROM track_point tp JOIN activity a ON a.id = tp.activity_id
        JOIN user u ON a.user_id = u.id
        GROUP BY user_id
    )
    SELECT MIN(tp_count), MAX(tp_count), AVG(tp_count) FROM user_tp_count;
    """

# Get the data as a DataFrame
df = query_to_dataframe(connection_string, sql_query)
df

   MIN(tp_count)  MAX(tp_count)  AVG(tp_count)
0             17        1010325     55963.9075

In [10]:
# Task 3

sql_query = """ 
    SELECT user_id, count(a.id) AS activity_count
    FROM user u JOIN activity a ON a.user_id = u.id
    GROUP BY u.id
    ORDER BY activity_count DESC
    LIMIT 15;
"""
df = query_to_dataframe(connection_string, sql_query)
df

   user_id  activity_count
0      128            2102
1      153            1793
2      025             715
3      163             704
4      062             691
5      144             563
6      041             399
7      085             364
8      004             346
9      140             345
10     167             320
11     068             280
12     017             265
13     003             261
14     014             236

In [11]:
#Task 4

sql_query = """ 
    SELECT user_id, transportation_mode  
    FROM user u JOIN activity a ON a.user_id = u.id
    WHERE a.transportation_mode = "bus"; 
"""
df = query_to_dataframe(connection_string, sql_query)
df

    user_id transportation_mode
0       091                 bus
1       175                 bus
2       091                 bus
3       092                 bus
4       010                 bus
..      ...                 ...
194     085                 bus
195     085                 bus
196     085                 bus
197     085                 bus
198     085                 bus

[199 rows x 2 columns]

In [12]:
#Task 5

#This is including those that have transportation_mode = NONE
sql_query = """ 
    SELECT user_id, COUNT(DISTINCT a.transportation_mode) AS num_of_different_transport_mode
    FROM user u JOIN activity a ON a.user_id = u.id
    GROUP BY u.id
    ORDER BY num_of_different_transport_mode DESC
    LIMIT 10; 
"""
df = query_to_dataframe(connection_string, sql_query)
df

  user_id  num_of_different_transport_mode
0     128                                9
1     062                                7
2     085                                4
3     084                                3
4     058                                3
5     163                                3
6     078                                3
7     081                                3
8     112                                3
9     065                                2

In [13]:
#Task 5 ALternative way
sql_query1 = """ 
    SELECT transportation_mode 
    FROM activity
"""
activity_df = query_to_dataframe(connection_string, sql_query1)
trans_mode_list = activity_df["transportation_mode"].unique()

select_statement = ", ".join([f"MAX(CASE WHEN transportation_mode = '{mode}' THEN 1 ELSE 0 END) AS {mode}" for mode in trans_mode_list])

sql_query = f"""
    SELECT
        user_id, 
        {select_statement},
        COUNT(DISTINCT a.transportation_mode) as num_of_different_transport_mode
    FROM user u JOIN activity a ON a.user_id = u.id
    GROUP BY u.id
    ORDER BY num_of_different_transport_mode DESC
    LIMIT 10; 
"""
df = query_to_dataframe(connection_string, sql_query)
df

,user_id,None,bike,taxi,walk,car,bus,subway,run,train,airplane,boat,num_of_different_transport_mode
0,128,0,1,1,1,1,1,1,0,1,1,1,9
1,062,0,1,1,1,1,1,0,1,1,0,0,7
2,085,0,0,1,1,0,1,1,0,0,0,0,4
3,084,0,0,0,1,0,1,1,0,0,0,0,3
4,058,0,0,1,1,1,0,0,0,0,0,0,3
5,163,0,1,1,1,0,0,0,0,0,0,0,3
6,078,0,0,1,1,0,0,1,0,0,0,0,3
7,081,0,1,0,1,0,1,0,0,0,0,0,3
8,112,0,1,0,1,0,1,0,0,0,0,0,3
9,065,0,1,0,1,0,0,0,0,0,0,0,2

In [14]:
#Task 6

sql_query = """ 

    SELECT id, COUNT(*) AS activity_count
    FROM activity 
    GROUP BY id
    HAVING COUNT(*) > 1 
    ORDER BY activity_count DESC;
"""

df = query_to_dataframe(connection_string, sql_query)
df

Empty DataFrame
Columns: [id, activity_count]
Index: []

In [15]:
#Task 7a 

sql_query = """

    SELECT COUNT(DISTINCT user_id) as number_of_users
    FROM activity a 
    WHERE DATE(a.start_date_time) != DATE(a.end_date_time) 
    AND TIMESTAMPDIFF(DAY, a.start_date_time, a.end_date_time) >= 1

"""

df = query_to_dataframe(connection_string, sql_query)
df

   number_of_users
0                5

In [16]:
#Task 7b 

sql_query = """

    SELECT a.transportation_mode, user_id, 
    CONCAT(
        TIMESTAMPDIFF(DAY, a.start_date_time, a.end_date_time), ' days ',
        HOUR(TIMEDIFF(a.end_date_time, a.start_date_time)), ' hours ',
        MINUTE(TIMEDIFF(a.end_date_time, a.start_date_time)), ' minutes ',
        SECOND(TIMEDIFF(a.end_date_time, a.start_date_time)), ' seconds'
    ) AS Duration
    FROM activity a
    WHERE DATE(a.start_date_time) != DATE(a.end_date_time)
    AND TIMESTAMPDIFF(DAY, a.start_date_time, a.end_date_time) >= 1

"""

df = query_to_dataframe(connection_string, sql_query)
df

  transportation_mode user_id                               Duration
0                None     099  1 days 28 hours 49 minutes 19 seconds
1                None     051    1 days 29 hours 1 minutes 3 seconds
2                None     144  1 days 28 hours 28 minutes 34 seconds
3                None     144  1 days 26 hours 28 minutes 35 seconds
4                None     028  1 days 29 hours 12 minutes 45 seconds
5                None     017  1 days 24 hours 32 minutes 16 seconds

In [ ]:
# Task 8

sql_query = """

    SELECT COUNT(DISTINCT u.id), TIMESTAMPDIFF(SECOND,  )
"""

df = query_to_dataframe(connection_string, sql_query)
df

In [38]:
#Task 9
#This query finds the top 15 users who have gained most altitude in meters across all their activities.  

sql_query = """ 

WITH alt_diff AS(
    SELECT 
        tp.activity_id, 
        tp.altitude * 0.3048 as current_altitude_meters, LAG(tp.altitude * 0.3048) OVER (PARTITION BY tp.activity_id ORDER BY date_time) AS prev_altitude_meters
    FROM track_point tp
    WHERE tp.altitude != -777 
), 

altitude_gained AS(
    SELECT 
        ad.activity_id, 
        SUM(CASE WHEN ad.current_altitude_meters > ad.prev_altitude_meters THEN ad.current_altitude_meters - ad.prev_altitude_meters ELSE 0 END) AS altitude_meters_gain
    FROM alt_diff ad
    GROUP BY ad.activity_id
)

SELECT a.user_id, SUM(ag.altitude_meters_gain) AS total_altitude_meters_gained
FROM activity a
JOIN altitude_gained ag ON a.id = ag.activity_id
GROUP BY a.user_id
ORDER BY SUM(ag.altitude_meters_gain) DESC 
LIMIT 15;
"""

df = query_to_dataframe(connection_string, sql_query)
df

   user_id  total_altitude_meters_gained
0      128                   650978.4288
1      153                   555019.4640
2      004                   332036.3184
3      041                   240758.4720
4      003                   233663.6424
5      085                   217642.1352
6      163                   205278.2280
7      062                   181688.2320
8      144                   179456.1816
9      030                   175641.9144
10     039                   146703.5928
11     084                   131161.2312
12     000                   121504.8624
13     002                   115062.9144
14     167                   112973.2056

In [34]:
# Task 10

def calculate_distance(position): 
    distance = 0 
    for i in range(1,len(position)): 
        tp = position[i-1]
        next_tp = position[i]
        distance += haversine((tp[0], tp[1]), (next_tp[0], next_tp[1]), unit=Unit.KILOMETERS)

    return distance    

sql_query = """ 
    SELECT a.user_id, a.transportation_mode, tp.lat, tp.lon, tp.date_time 
    FROM activity a JOIN track_point tp ON a.id = tp.activity_id
    WHERE a.transportation_mode != "None"
    
"""

temp_df = query_to_dataframe(connection_string, sql_query)
temp_df["day"] = temp_df["date_time"].dt.date

result = temp_df.groupby(['user_id', 'day', 'transportation_mode']) \
                 .apply(lambda x: calculate_distance(x[['lat', 'lon']].values)) \
                 .reset_index(name='segment_distance')

highest_distance_per_mode = result.sort_values('segment_distance', ascending=False) \
    .groupby('transportation_mode').first().reset_index()

highest_distance_per_mode

  transportation_mode user_id         day  segment_distance
0            airplane     128  2009-03-06       2527.119758
1                bike     128  2008-06-28         63.120602
2                boat     128  2008-11-22         65.554763
3                 bus     128  2009-01-20        207.412969
4                 car     128  2009-01-19       1613.730930
5                 run     062  2008-09-02          0.033253
6              subway     128  2008-10-31         38.877547
7                taxi     128  2008-09-30         40.223277
8               train     062  2008-09-02        277.257577
9                walk     062  2008-10-05         42.352596

In [36]:
# Task 8

sql_query = """

    SELECT a.user_id, tp.date_time, tp.lat, tp.lon
    FROM activity a JOIN track_point tp ON a.id = tp.activity_id
"""

df = query_to_dataframe(connection_string, sql_query)
df

        user_id           date_time        lat         lon
0           000 2009-04-12 07:33:03  40.000017  116.327479
1           000 2009-04-12 07:33:09  40.000168  116.327474
2           000 2009-04-12 07:33:14  40.000055  116.327454
3           000 2009-04-12 07:33:19  40.000021  116.327407
4           000 2009-04-12 07:33:24  40.000035  116.327281
...         ...                 ...        ...         ...
9681751     181 2007-12-08 07:09:44  39.866483  116.415383
9681752     181 2007-12-08 07:11:20  39.866033  116.415683
9681753     181 2007-12-08 07:12:42  39.865550  116.415733
9681754     181 2007-12-08 07:14:02  39.864883  116.415750
9681755     181 2007-12-08 07:15:40  39.864567  116.416250

[9681756 rows x 4 columns]

In [42]:
from itertools import combinations
from datetime import timedelta

unique_user_ids = df["user_id"].unique()
user_combinations = list(combinations(unique_user_ids, 2))

def filter_by_time(df, other_user_id):
    results = []
    for i, row in df.iterrows(): 
        time_window = (row["date_time"] - timedelta(seconds=30), row["date_time"] + timedelta(seconds=30))
        other_user_rows = df[(df['user_id'] == other_user_id) & (df['date_time'] >= time_window[0]) & (df['date_time'] <= time_window[1])]
        results.extend(other_user_rows.to_dict("records"))
    return pd.DataFrame(results)

filtered_rows = []
for user_1, user_2 in user_combinations:
    user_1_rows = df[df["user_id"] == user_1]
    filtered_rows.append(filter_by_time(user_1_rows, user_2))

filtered_df = pd.concat(filtered_rows, ignore_index=True)

KeyboardInterrupt:

In [ ]:
filtered_df

In [4]:
#Task 11

sql_query = """ 
    WITH track_point_diff AS(
        SELECT tp.activity_id, tp.date_time, 
        TIMESTAMPDIFF(MINUTE, tp.date_time, LEAD(tp.date_time) OVER (PARTITION BY tp.activity_id ORDER BY tp.date_time)) AS minute_diff
        FROM track_point tp
    )

    SELECT a.user_id, COUNT(DISTINCT tpd.activity_id) AS invalid_activities_number 
    FROM track_point_diff tpd JOIN activity a ON tpd.activity_id = a.id 
    WHERE tpd.minute_diff >= 5 
    GROUP BY a.user_id
    ORDER BY COUNT(DISTINCT tpd.activity_id) DESC
    
"""

df = query_to_dataframe(connection_string, sql_query)
df

    user_id  invalid_activities_number
0       128                        720
1       153                        557
2       025                        263
3       062                        249
4       163                        233
..      ...                        ...
166     060                          1
167     107                          1
168     113                          1
169     141                          1
170     151                          1

[171 rows x 2 columns]

In [5]:
#Task 12
""" 
In this query we have chosen to use MAX()-operator for those instances where a user may have same number of activites tagged with different transporation_mode. Since this operator will select the maximum based on 
alphabetic order of the transportation mode string then for instance bus would be chosen over walk etc. 

"""
sql_query = """ 
    WITH filter_user_transportation AS(
        SELECT a.user_id, a.transportation_mode 
        FROM activity a 
        WHERE a.transportation_mode != "None"
        GROUP BY a.transportation_mode, a.user_id
    )

    SELECT u.id, MAX(fut.transportation_mode) AS most_used_transportation_mode
    FROM user u JOIN filter_user_transportation fut ON u.id = fut.user_id 
    GROUP BY u.id 
    ORDER BY u.id 

"""
df = query_to_dataframe(connection_string, sql_query)
df

     id most_used_transportation_mode
0   010                          taxi
1   020                          walk
2   021                          walk
3   052                           bus
4   056                          bike
5   058                          walk
6   060                          walk
7   062                          walk
8   064                          bike
9   065                          walk
10  067                          walk
11  069                          bike
12  073                          walk
13  075                          walk
14  076                           car
15  078                          walk
16  080                          taxi
17  081                          walk
18  082                          walk
19  084                          walk
20  085                          walk
21  086                          walk
22  087                          walk
23  089                          walk
24  091                          walk
25  092                          walk
26  097                          bike
27  098                          taxi
28  101                           car
29  102                          walk
30  107                          walk
31  108                          walk
32  111                          taxi
33  112                          walk
34  115                          walk
35  117                          walk
36  125                           bus
37  126                          walk
38  128                          walk
39  136                          walk
40  138                          bike
41  139                          walk
42  144                          walk
43  153                          walk
44  161                          walk
45  163                          walk
46  167                          walk
47  175                           bus